constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.3048 0.0 -0.3) // Vertex 0
    (0.0 0.0 -0.3) // Vertex 1
    (0.012 0.0 -0.3) // Vertex 2
    (0.014 0.0 -0.3) // Vertex 3
    (0.022 0.0 -0.3) // Vertex 4
    (0.03 0.0 -0.3) // Vertex 5
    (0.038 0.0 -0.3) // Vertex 6
    (0.338 0.0 -0.3) // Vertex 7
    (-0.3048 0.0 0.0) // Vertex 8
    (0.0 0.0 0.0) // Vertex 9
    (0.012 0.0 0.0) // Vertex 10
    (0.014 0.0 0.0) // Vertex 11
    (0.022 0.0 0.0) // Vertex 12
    (0.03 0.0 0.0) // Vertex 13
    (0.038 0.0 0.0) // Vertex 14
    (0.338 0.0 0.0) // Vertex 15
    (-0.3048 0.0 0.002) // Vertex 16
    (0.0 0.0 0.002) // Vertex 17
    (0.012 0.0 0.002) // Vertex 18
    (0.014 0.0 0.002) // Vertex 19
    (0.022 0.0 0.002) // Vertex 20
    (0.03 0.0 0.002) // Vertex 21
    (0.038 0.0 0.002) // Vertex 22
    (0.338 0.0 0.002) // Vertex 23
    (-0.3048 0.0 0.0075) // Vertex 24
    (0.0 0.0 0.0075) // Vertex 25
    (0.012 0.0 0.0075) // Vertex 26
    (0.014 0.0 0.0075) // Vertex 27
    (0.022 0.0 0.0075) // Vertex 28
    (0.03 0.0 0.0075) // Vertex 29
    (0.038 0.0 0.0075) // Vertex 30
    (0.338 0.0 0.0075) // Vertex 31
    (-0.3048 0.0 0.015) // Vertex 32
    (0.0 0.0 0.015) // Vertex 33
    (0.012 0.0 0.015) // Vertex 34
    (0.014 0.0 0.015) // Vertex 35
    (0.022 0.0 0.015) // Vertex 36
    (0.03 0.0 0.015) // Vertex 37
    (0.038 0.0 0.015) // Vertex 38
    (0.338 0.0 0.015) // Vertex 39
    (-0.3048 0.0 0.026) // Vertex 40
    (0.0 0.0 0.026) // Vertex 41
    (0.012 0.0 0.026) // Vertex 42
    (0.014 0.0 0.026) // Vertex 43
    (0.022 0.0 0.026) // Vertex 44
    (0.03 0.0 0.026) // Vertex 45
    (0.038 0.0 0.026) // Vertex 46
    (0.338 0.0 0.026) // Vertex 47
    (-0.3048 0.0 0.039) // Vertex 48
    (0.0 0.0 0.039) // Vertex 49
    (0.012 0.0 0.039) // Vertex 50
    (0.014 0.0 0.039) // Vertex 51
    (0.022 0.0 0.039) // Vertex 52
    (0.03 0.0 0.039) // Vertex 53
    (0.038 0.0 0.039) // Vertex 54
    (0.338 0.0 0.039) // Vertex 55
    (-0.3048 0.0 0.339) // Vertex 56
    (0.0 0.0 0.339) // Vertex 57
    (0.012 0.0 0.339) // Vertex 58
    (0.014 0.0 0.339) // Vertex 59
    (0.022 0.0 0.339) // Vertex 60
    (0.03 0.0 0.339) // Vertex 61
    (0.038 0.0 0.339) // Vertex 62
    (0.338 0.0 0.339) // Vertex 63
    (-0.3048 0.01 -0.3) // Vertex 64
    (0.0 0.01 -0.3) // Vertex 65
    (0.012 0.01 -0.3) // Vertex 66
    (0.014 0.01 -0.3) // Vertex 67
    (0.022 0.01 -0.3) // Vertex 68
    (0.03 0.01 -0.3) // Vertex 69
    (0.038 0.01 -0.3) // Vertex 70
    (0.338 0.01 -0.3) // Vertex 71
    (-0.3048 0.01 0.0) // Vertex 72
    (0.0 0.01 0.0) // Vertex 73
    (0.012 0.01 0.0) // Vertex 74
    (0.014 0.01 0.0) // Vertex 75
    (0.022 0.01 0.0) // Vertex 76
    (0.03 0.01 0.0) // Vertex 77
    (0.038 0.01 0.0) // Vertex 78
    (0.338 0.01 0.0) // Vertex 79
    (-0.3048 0.01 0.002) // Vertex 80
    (0.0 0.01 0.002) // Vertex 81
    (0.012 0.01 0.002) // Vertex 82
    (0.014 0.01 0.002) // Vertex 83
    (0.022 0.01 0.002) // Vertex 84
    (0.03 0.01 0.002) // Vertex 85
    (0.038 0.01 0.002) // Vertex 86
    (0.338 0.01 0.002) // Vertex 87
    (-0.3048 0.01 0.0075) // Vertex 88
    (0.0 0.01 0.0075) // Vertex 89
    (0.012 0.01 0.0075) // Vertex 90
    (0.014 0.01 0.0075) // Vertex 91
    (0.022 0.01 0.0075) // Vertex 92
    (0.03 0.01 0.0075) // Vertex 93
    (0.038 0.01 0.0075) // Vertex 94
    (0.338 0.01 0.0075) // Vertex 95
    (-0.3048 0.01 0.015) // Vertex 96
    (0.0 0.01 0.015) // Vertex 97
    (0.012 0.01 0.015) // Vertex 98
    (0.014 0.01 0.015) // Vertex 99
    (0.022 0.01 0.015) // Vertex 100
    (0.03 0.01 0.015) // Vertex 101
    (0.038 0.01 0.015) // Vertex 102
    (0.338 0.01 0.015) // Vertex 103
    (-0.3048 0.01 0.026) // Vertex 104
    (0.0 0.01 0.026) // Vertex 105
    (0.012 0.01 0.026) // Vertex 106
    (0.014 0.01 0.026) // Vertex 107
    (0.022 0.01 0.026) // Vertex 108
    (0.03 0.01 0.026) // Vertex 109
    (0.038 0.01 0.026) // Vertex 110
    (0.338 0.01 0.026) // Vertex 111
    (-0.3048 0.01 0.039) // Vertex 112
    (0.0 0.01 0.039) // Vertex 113
    (0.012 0.01 0.039) // Vertex 114
    (0.014 0.01 0.039) // Vertex 115
    (0.022 0.01 0.039) // Vertex 116
    (0.03 0.01 0.039) // Vertex 117
    (0.038 0.01 0.039) // Vertex 118
    (0.338 0.01 0.039) // Vertex 119
    (-0.3048 0.01 0.339) // Vertex 120
    (0.0 0.01 0.339) // Vertex 121
    (0.012 0.01 0.339) // Vertex 122
    (0.014 0.01 0.339) // Vertex 123
    (0.022 0.01 0.339) // Vertex 124
    (0.03 0.01 0.339) // Vertex 125
    (0.038 0.01 0.339) // Vertex 126
    (0.338 0.01 0.339) // Vertex 127
);
blocks
(
    hex ( 0 1 65 64 8 9 73 72  ) (100 1 100) simpleGrading (1 1 1)// block 0
    hex ( 1 2 66 65 9 10 74 73  ) (12 1 100) simpleGrading (1 1 1)// block 1
    hex ( 2 3 67 66 10 11 75 74  ) (2 1 100) simpleGrading (1 1 1)// block 2
    hex ( 3 4 68 67 11 12 76 75  ) (8 1 100) simpleGrading (1 1 1)// block 3
    hex ( 4 5 69 68 12 13 77 76  ) (8 1 100) simpleGrading (1 1 1)// block 4
    hex ( 5 6 70 69 13 14 78 77  ) (8 1 100) simpleGrading (1 1 1)// block 5
    hex ( 6 7 71 70 14 15 79 78  ) (100 1 100) simpleGrading (1 1 1)// block 6
    hex ( 8 9 73 72 16 17 81 80  ) (100 1 2) simpleGrading (1 1 1)// block 7
    hex ( 9 10 74 73 17 18 82 81  ) (12 1 2) simpleGrading (1 1 1)// block 8
    hex ( 10 11 75 74 18 19 83 82  ) (2 1 2) simpleGrading (1 1 1)// block 9
    hex ( 11 12 76 75 19 20 84 83  ) (8 1 2) simpleGrading (1 1 1)// block 10
    hex ( 12 13 77 76 20 21 85 84  ) (8 1 2) simpleGrading (1 1 1)// block 11
    hex ( 13 14 78 77 21 22 86 85  ) (8 1 2) simpleGrading (1 1 1)// block 12
    hex ( 14 15 79 78 22 23 87 86  ) (100 1 2) simpleGrading (1 1 1)// block 13
    hex ( 18 19 83 82 26 27 91 90  ) (2 1 3) simpleGrading (1 1 1)// block 14
    hex ( 19 20 84 83 27 28 92 91  ) (8 1 3) simpleGrading (1 1 1)// block 15
    hex ( 20 21 85 84 28 29 93 92  ) (8 1 3) simpleGrading (1 1 1)// block 16
    hex ( 21 22 86 85 29 30 94 93  ) (8 1 3) simpleGrading (1 1 1)// block 17
    hex ( 22 23 87 86 30 31 95 94  ) (100 1 3) simpleGrading (1 1 1)// block 18
    hex ( 26 27 91 90 34 35 99 98  ) (2 1 2) simpleGrading (1 1 1)// block 19
    hex ( 27 28 92 91 35 36 100 99  ) (8 1 2) simpleGrading (1 1 1)// block 20
    hex ( 28 29 93 92 36 37 101 100  ) (8 1 2) simpleGrading (1 1 1)// block 21
    hex ( 29 30 94 93 37 38 102 101  ) (8 1 2) simpleGrading (1 1 1)// block 22
    hex ( 30 31 95 94 38 39 103 102  ) (100 1 2) simpleGrading (1 1 1)// block 23
    hex ( 34 35 99 98 42 43 107 106  ) (2 1 3) simpleGrading (1 1 1)// block 24
    hex ( 35 36 100 99 43 44 108 107  ) (8 1 3) simpleGrading (1 1 1)// block 25
    hex ( 36 37 101 100 44 45 109 108  ) (8 1 3) simpleGrading (1 1 1)// block 26
    hex ( 37 38 102 101 45 46 110 109  ) (8 1 3) simpleGrading (1 1 1)// block 27
    hex ( 38 39 103 102 46 47 111 110  ) (100 1 3) simpleGrading (1 1 1)// block 28
    hex ( 40 41 105 104 48 49 113 112  ) (100 1 2) simpleGrading (1 1 1)// block 29
    hex ( 41 42 106 105 49 50 114 113  ) (12 1 2) simpleGrading (1 1 1)// block 30
    hex ( 42 43 107 106 50 51 115 114  ) (2 1 2) simpleGrading (1 1 1)// block 31
    hex ( 43 44 108 107 51 52 116 115  ) (8 1 2) simpleGrading (1 1 1)// block 32
    hex ( 44 45 109 108 52 53 117 116  ) (8 1 2) simpleGrading (1 1 1)// block 33
    hex ( 45 46 110 109 53 54 118 117  ) (8 1 2) simpleGrading (1 1 1)// block 34
    hex ( 46 47 111 110 54 55 119 118  ) (100 1 2) simpleGrading (1 1 1)// block 35
    hex ( 48 49 113 112 56 57 121 120  ) (100 1 100) simpleGrading (1 1 1)// block 36
    hex ( 49 50 114 113 57 58 122 121  ) (12 1 100) simpleGrading (1 1 1)// block 37
    hex ( 50 51 115 114 58 59 123 122  ) (2 1 100) simpleGrading (1 1 1)// block 38
    hex ( 51 52 116 115 59 60 124 123  ) (8 1 100) simpleGrading (1 1 1)// block 39
    hex ( 52 53 117 116 60 61 125 124  ) (8 1 100) simpleGrading (1 1 1)// block 40
    hex ( 53 54 118 117 61 62 126 125  ) (8 1 100) simpleGrading (1 1 1)// block 41
    hex ( 54 55 119 118 62 63 127 126  ) (100 1 100) simpleGrading (1 1 1)// block 42
);
edges
(
);
patches
(
    symmetryPlane left
    (
        (0 8 72 64 )
        (8 16 80 72 )
        (40 48 112 104 )
        (48 56 120 112 )
    )

    patch right
    (
        (7 71 79 15 )
        (15 79 87 23 )
        (23 87 95 31 )
        (31 95 103 39 )
        (39 103 111 47 )
        (47 111 119 55 )
        (55 119 127 63 )
    )

    patch inlet
    (
        (0 64 65 1 )
        (1 65 66 2 )
        (2 66 67 3 )
        (3 67 68 4 )
        (4 68 69 5 )
        (5 69 70 6 )
        (6 70 71 7 )
    )

    patch outlet
    (
        (56 57 121 120 )
        (57 58 122 121 )
        (58 59 123 122 )
        (59 60 124 123 )
        (60 61 125 124 )
        (61 62 126 125 )
        (62 63 127 126 )
    )

    wall bottom
    (
        (16 17 81 80 )
    )

    wall top
    (
        (40 104 105 41 )
    )

    patch applied
    (
        (18 26 90 82 )
        (26 34 98 90 )
        (34 42 106 98 )
    )

    empty front
    (
        (0 1 9 8 )
        (1 2 10 9 )
        (2 3 11 10 )
        (3 4 12 11 )
        (4 5 13 12 )
        (5 6 14 13 )
        (6 7 15 14 )
        (8 9 17 16 )
        (9 10 18 17 )
        (10 11 19 18 )
        (11 12 20 19 )
        (12 13 21 20 )
        (13 14 22 21 )
        (14 15 23 22 )
        (18 19 27 26 )
        (19 20 28 27 )
        (20 21 29 28 )
        (21 22 30 29 )
        (22 23 31 30 )
        (26 27 35 34 )
        (27 28 36 35 )
        (28 29 37 36 )
        (29 30 38 37 )
        (30 31 39 38 )
        (34 35 43 42 )
        (35 36 44 43 )
        (36 37 45 44 )
        (37 38 46 45 )
        (38 39 47 46 )
        (40 41 49 48 )
        (41 42 50 49 )
        (42 43 51 50 )
        (43 44 52 51 )
        (44 45 53 52 )
        (45 46 54 53 )
        (46 47 55 54 )
        (48 49 57 56 )
        (49 50 58 57 )
        (50 51 59 58 )
        (51 52 60 59 )
        (52 53 61 60 )
        (53 54 62 61 )
        (54 55 63 62 )
    )

    empty back
    (
        (65 64 72 73 )
        (66 65 73 74 )
        (67 66 74 75 )
        (68 67 75 76 )
        (69 68 76 77 )
        (70 69 77 78 )
        (71 70 78 79 )
        (73 72 80 81 )
        (74 73 81 82 )
        (75 74 82 83 )
        (76 75 83 84 )
        (77 76 84 85 )
        (78 77 85 86 )
        (79 78 86 87 )
        (83 82 90 91 )
        (84 83 91 92 )
        (85 84 92 93 )
        (86 85 93 94 )
        (87 86 94 95 )
        (91 90 98 99 )
        (92 91 99 100 )
        (93 92 100 101 )
        (94 93 101 102 )
        (95 94 102 103 )
        (99 98 106 107 )
        (100 99 107 108 )
        (101 100 108 109 )
        (102 101 109 110 )
        (103 102 110 111 )
        (105 104 112 113 )
        (106 105 113 114 )
        (107 106 114 115 )
        (108 107 115 116 )
        (109 108 116 117 )
        (110 109 117 118 )
        (111 110 118 119 )
        (113 112 120 121 )
        (114 113 121 122 )
        (115 114 122 123 )
        (116 115 123 124 )
        (117 116 124 125 )
        (118 117 125 126 )
        (119 118 126 127 )
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
