system/heatSink/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        applied
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            "heatSink_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffle;
                neighbourFieldName T;
                K               K;
                value           uniform 300;
            }
            applied
            {
               type            fixedValue;
               value           uniform 350;
            }
        }
    }

    rho
    {
        internalField   uniform 2770;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 2770;
            }
        }
    }

    K
    {
        internalField   uniform 177;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 177;
            }
        }
    }
    cp
    {
        internalField   uniform 875;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 875;
            }
        }
    }

}

// ************************************************************************* //
